In [1]:
print("Hello")

Hello

In [3]:
import tensorflow as tf
print(tf.__version__)

2.19.0

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
datasets = pd.read_csv("Churn_Modelling.csv")

In [6]:
datasets.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [8]:
X = datasets.iloc[:, 3:13]
Y = datasets.iloc[: , 13]

In [9]:
X.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,Female,42,2,0.00,1,1,1,101348.88
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58
2,502,France,Female,42,8,159660.80,3,1,0,113931.57
3,699,France,Female,39,1,0.00,2,0,0,93826.63
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10

In [10]:
Y

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [18]:
Geography = pd.get_dummies(X['Geography'], drop_first =True).astype(int)
Gender = pd.get_dummies(X['Gender'] , drop_first = True).astype(int)

      Male
0        0
1        0
2        0
3        0
4        0
...    ...
9995     1
9996     1
9997     0
9998     1
9999     0

[10000 rows x 1 columns]

In [20]:
X.drop(['Geography', 'Gender'] , axis = 1)

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,42,2,0.00,1,1,1,101348.88
1,608,41,1,83807.86,1,0,1,112542.58
2,502,42,8,159660.80,3,1,0,113931.57
3,699,39,1,0.00,2,0,0,93826.63
4,850,43,2,125510.82,1,1,1,79084.10
...,...,...,...,...,...,...,...,...
9995,771,39,5,0.00,2,1,0,96270.64
9996,516,35,10,57369.61,1,1,1,101699.77
9997,709,36,7,0.00,1,0,1,42085.58
9998,772,42,3,75075.31,2,1,0,92888.52
9999,792,28,4,130142.79,1,1,0,38190.78

In [22]:
X = pd.concat([X, Geography , Gender] , axis = 1)

In [23]:
X

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Germany,Spain,Male
0,619,France,Female,42,2,0.00,1,1,1,101348.88,0,0,0
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,1,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,0,0,0
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,771,France,Male,39,5,0.00,2,1,0,96270.64,0,0,1
9996,516,France,Male,35,10,57369.61,1,1,1,101699.77,0,0,1
9997,709,France,Female,36,7,0.00,1,0,1,42085.58,0,0,0
9998,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1,0,1
9999,792,France,Female,28,4,130142.79,1,1,0,38190.78,0,0,0

In [24]:
from sklearn.model_selection import train_test_split

X_train , X_test , y_train , y_test = train_test_split(X , Y , test_size = 0.2 , random_state=0)

In [25]:
X_train

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Germany,Spain,Male
7389,667,Spain,Female,34,5,0.00,2,1,0,163830.64,0,1,0
9275,427,Germany,Male,42,1,75681.52,1,1,1,57098.00,1,0,1
2995,535,France,Female,29,2,112367.34,1,1,0,185630.76,0,0,0
5316,654,Spain,Male,40,5,105683.63,1,1,0,173617.09,0,1,1
356,850,Spain,Female,57,8,126776.30,2,1,1,132298.49,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9225,594,Germany,Female,32,4,120074.97,2,1,1,162961.79,1,0,0
4859,794,Spain,Female,22,4,114440.24,1,1,1,107753.07,0,1,0
3264,738,France,Male,35,5,161274.05,2,1,0,181429.87,0,0,1
9845,590,Spain,Female,38,9,0.00,2,1,1,148750.16,0,1,0
2732,623,Germany,Female,48,1,108076.33,1,1,0,118855.26,1,0,0

In [26]:
X_test

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Germany,Spain,Male
9394,597,Germany,Female,35,8,131101.04,1,1,1,192852.67,1,0,0
898,523,France,Female,40,2,102967.41,1,1,0,128702.10,0,0,0
2398,706,Spain,Female,42,8,95386.82,1,1,1,75732.25,0,1,0
5906,788,France,Male,32,4,112079.58,1,0,0,89368.59,0,0,1
2343,706,Germany,Male,38,5,163034.82,2,1,1,135662.17,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1037,625,France,Female,24,1,0.00,2,1,1,180969.55,0,0,0
2899,586,France,Female,35,7,0.00,2,1,0,70760.69,0,0,0
9549,578,Spain,Male,36,1,157267.95,2,1,0,141533.19,0,1,1
2740,650,Germany,Male,34,4,142393.11,1,1,1,11276.48,1,0,1
6690,573,Germany,Male,30,8,127406.50,1,1,0,192950.60,1,0,1

In [27]:
y_train

7389    0
9275    0
2995    0
5316    0
356     0
       ..
9225    0
4859    0
3264    0
9845    0
2732    1
Name: Exited, Length: 8000, dtype: int64

In [28]:
y_test

9394    0
898     1
2398    0
5906    0
2343    0
       ..
1037    0
2899    0
9549    0
2740    0
6690    0
Name: Exited, Length: 2000, dtype: int64